InformationRegisters/НастройкиИнтеграцииКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидКонтактнойИнформацииМобильныйТелефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидКонтактнойИнформацииАдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуетсяКадровыйЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейСохраненияПубликации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПубликоватьСтруктуруЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОбсуждения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧатБот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоординаторОбсуждений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПриложенияСовместногоИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПолученияСогласияНаПрисоединениеККЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияСогласияНаПрисоединениеККЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОтчетаРасчетныйЛисток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьРасчетныеЛистыОтдельнымЗапросом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыПолученияСогласияНаПрисоединениеККЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СпособыПолученияСогласияНаПрисоединениеККЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БумажныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УНЭП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииКабинетСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НастройкиИнтеграции() Экспорт
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника);
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ВидКонтактнойИнформацииМобильныйТелефон) Тогда
		СтруктураНастроек.ВидКонтактнойИнформацииМобильныйТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ВидКонтактнойИнформацииАдресЭлектроннойПочты) Тогда
		СтруктураНастроек.ВидКонтактнойИнформацииАдресЭлектроннойПочты = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ДнейСохраненияПубликации) Тогда
		СтруктураНастроек.ДнейСохраненияПубликации = 5;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.СпособПолученияСогласияНаПрисоединениеККЭДО) Тогда
		СтруктураНастроек.СпособПолученияСогласияНаПрисоединениеККЭДО = Перечисления.СпособыПолученияСогласияНаПрисоединениеККЭДО.БумажныйДокумент;	
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура СохранитьНовыеВидыКонтактнойИнформации(ВидКИМобильныйТелефон, ВидКИАдресЭлектроннойПочты) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ВидКонтактнойИнформацииМобильныйТелефон = ВидКИМобильныйТелефон;
	Настройки.ВидКонтактнойИнформацииАдресЭлектроннойПочты = ВидКИАдресЭлектроннойПочты;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеИспользуетсяКадровыйЭДО(ИспользуетсяКадровыйЭДО) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ИспользуетсяКадровыйЭДО = ИспользуетсяКадровыйЭДО;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОбновитьНастройкиФункциональностьСервиса");
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеДнейСохраненияПубликации(ДнейСохраненияПубликации) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ДнейСохраненияПубликации = ДнейСохраненияПубликации;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеПубликоватьСтруктуруЮридическихЛиц(НовоеЗначение) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ПубликоватьСтруктуруЮридическихЛиц = НовоеЗначение;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеКоординаторОбсуждений(НовоеЗначение) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.КоординаторОбсуждений = НовоеЗначение;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеИдентификаторПриложенияСовместногоИспользования(НовоеЗначение) Экспорт

	Настройки = НастройкиИнтеграции();
	Настройки.ИдентификаторПриложенияСовместногоИспользования = НовоеЗначение;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеСпособПолученияСогласияНаПрисоединениеККЭДО(СпособПолучения) Экспорт
	
	Настройки = НастройкиИнтеграции();
	Настройки.СпособПолученияСогласияНаПрисоединениеККЭДО = СпособПолучения;
	
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОбновитьНастройкиФункциональностьСервиса");
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура СохранитьЗначениеВариантОтчетаРасчетныйЛисток(ВариантОтчетаРасчетныйЛисток) Экспорт
	Настройки = НастройкиИнтеграции();
	Настройки.ВариантОтчетаРасчетныйЛисток = ВариантОтчетаРасчетныйЛисток;
	СохранитьНастройки(Настройки);
КонецПроцедуры

Процедура СохранитьЗначениеВариантОтчетаРасчетныйЛистокЗаПервуюПоловину(ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину) Экспорт
	Настройки = НастройкиИнтеграции();
	Настройки.ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину = ВариантОтчетаРасчетныйЛистокЗаПервуюПоловину;
	СохранитьНастройки(Настройки);
КонецПроцедуры

Процедура СохранитьЗначениеФормироватьРасчетныеЛистыОтдельнымЗапросом(ФормироватьРасчетныеЛистыОтдельнымЗапросом) Экспорт
	Настройки = НастройкиИнтеграции();
	Настройки.ФормироватьРасчетныеЛистыОтдельнымЗапросом = ФормироватьРасчетныеЛистыОтдельнымЗапросом;
	СохранитьНастройки(Настройки);
КонецПроцедуры

Процедура СохранитьНастройки(Настройки)
	НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
